# 상근이의 할머니는 아래 그림과 같이 오래된 다이얼 전화기를 사용한다.
# 전화를 걸고 싶은 번호가 있다면, 숫자를 하나를 누른 다음에 금속 핀이 있는 곳 까지 시계방향으로 돌려야 한다. 숫자를 하나 누르면 다이얼이 처음 위치로 돌아가고, 다음 숫자를 누르려면 다이얼을 처음 위치에서 다시 돌려야 한다.
# 숫자 1을 걸려면 총 2초가 필요하다. 1보다 큰 수를 거는데 걸리는 시간은 이보다 더 걸리며, 한 칸 옆에 있는 숫자를 걸기 위해선 1초씩 더 걸린다.
# 상근이의 할머니는 전화 번호를 각 숫자에 해당하는 문자로 외운다. 즉, 어떤 단어를 걸 때, 각 알파벳에 해당하는 숫자를 걸면 된다. 예를 들어, UNUCIC는 868242와 같다.
# 할머니가 외운 단어가 주어졌을 때, 이 전화를 걸기 위해서 필요한 최소 시간을 구하는 프로그램을 작성하시오.

# 입력
# 첫째 줄에 알파벳 대문자로 이루어진 단어가 주어진다. 단어의 길이는 2보다 크거나 같고, 15보다 작거나 같다.

# 출력
# 첫째 줄에 다이얼을 걸기 위해서 필요한 최소 시간을 출력한다.

# 예제 입력 1 
# WA
# 예제 출력 1 
# 13

# 1 = 2s
# abc = 3s
# def = 4s
# ghi = 5s
# jkl = 6s
# mno = 7s
# pqrs = 8s
# tuv = 9s
# wxyz = 10s
# 0 = 11s ???

dial = input().lower()
dial_dict = {'a':3, 'b':3, 'c':3,
            'd':4, 'e':4, 'f':4,
            'g':5, 'h':5, 'i':5,
            'j':6, 'k':6, 'l':6,
            'm':7, 'n':7, 'o':7,
            'p':8, 'q':8, 'r':8, 's':8,
            't':9, 'u':9, 'v':9,
            'w':10, 'x':10, 'y':10, 'z':10}
time = 0
for input_letter in dial:
    for key in dial_dict:
        if key in input_letter:
            time += dial_dict[key]
print(time)
